## Terraform Plan - `qa-tests`

**📊 Plan Summary**
```
Plan: 72 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + cluster_arn      = (known after apply)
  + cluster_endpoint = (known after apply)
  + cluster_id       = (known after apply)
```

<details>
<summary>📋 Show Full Plan</summary>

```terraform
2025-12-27T12:23:56.276Z [INFO]  Terraform version: 1.14.0
2025-12-27T12:23:56.276Z [INFO]  Go runtime version: go1.25.4
2025-12-27T12:23:56.276Z [INFO]  CLI args: []string{"/home/runner/work/_temp/ee1342e2-456f-4b5c-b0ef-6b50211e551e/terraform-bin", "plan", "-no-color", "-input=false", "-out=tfplan"}
2025-12-27T12:23:56.276Z [INFO]  CLI command args: []string{"plan", "-no-color", "-input=false", "-out=tfplan"}
2025-12-27T12:23:56.279Z [INFO]  backend-s3.aws-base: Retrieved credentials: tf_backend.operation=Configure tf_backend.req_id=91b3286b-5d54-4c53-7e8b-5176ad621eed tf_backend.s3.bucket=mbocak-kubernetes-tf-state-bucket tf_backend.s3.path=state/qa-tests/terraform.tfstate tf_aws.credentials_source=EnvConfigCredentials
2025-12-27T12:23:56.663Z [INFO]  backend-s3.aws-base: Retrieved caller identity from STS: tf_backend.operation=Configure tf_backend.req_id=91b3286b-5d54-4c53-7e8b-5176ad621eed tf_backend.s3.bucket=mbocak-kubernetes-tf-state-bucket tf_backend.s3.path=state/qa-tests/terraform.tfstate
2025-12-27T12:23:56.757Z [INFO]  backend-s3.aws-base: Retrieved caller identity from STS: tf_backend.operation=Configure tf_backend.req_id=91b3286b-5d54-4c53-7e8b-5176ad621eed tf_backend.s3.bucket=mbocak-kubernetes-tf-state-bucket tf_backend.s3.path=state/qa-tests/terraform.tfstate
2025-12-27T12:23:57.470Z [INFO]  backend/local: starting Plan operation
2025-12-27T12:23:57.803Z [INFO]  backend-s3: Downloading remote state: tf_backend.operation=Get tf_backend.req_id=94a8768f-140e-1c20-2dd1-6f24918114c2 tf_backend.s3.bucket=mbocak-kubernetes-tf-state-bucket tf_backend.s3.path=state/qa-tests/terraform.tfstate
2025-12-27T12:23:57.975Z [INFO]  provider: configuring client automatic mTLS
2025-12-27T12:23:58.148Z [INFO]  provider.terraform-provider-aws_v6.27.0_x5: configuring server automatic mTLS: timestamp=2025-12-27T12:23:58.148Z
2025-12-27T12:23:59.249Z [INFO]  provider: plugin process exited: plugin=.terraform/providers/registry.terraform.io/hashicorp/aws/6.27.0/linux_amd64/terraform-provider-aws_v6.27.0_x5 id=2432
2025-12-27T12:23:59.249Z [INFO]  provider: configuring client automatic mTLS
2025-12-27T12:23:59.258Z [INFO]  provider.terraform-provider-cloudinit_v2.3.7_x5: configuring server automatic mTLS: timestamp=2025-12-27T12:23:59.258Z
2025-12-27T12:23:59.285Z [INFO]  provider: plugin process exited: plugin=.terraform/providers/registry.terraform.io/hashicorp/cloudinit/2.3.7/linux_amd64/terraform-provider-cloudinit_v2.3.7_x5 id=2443
2025-12-27T12:23:59.285Z [INFO]  provider: configuring client automatic mTLS
2025-12-27T12:23:59.307Z [INFO]  provider.terraform-provider-helm_v2.17.0_x5: configuring server automatic mTLS: timestamp=2025-12-27T12:23:59.307Z
2025-12-27T12:23:59.335Z [INFO]  provider: plugin process exited: plugin=.terraform/providers/registry.terraform.io/hashicorp/helm/2.17.0/linux_amd64/terraform-provider-helm_v2.17.0_x5 id=2451
2025-12-27T12:23:59.336Z [INFO]  provider: configuring client automatic mTLS
2025-12-27T12:23:59.368Z [INFO]  provider.terraform-provider-kubernetes_v2.38.0_x5: configuring server automatic mTLS: timestamp=2025-12-27T12:23:59.368Z
2025-12-27T12:23:59.468Z [INFO]  provider: plugin process exited: plugin=.terraform/providers/registry.terraform.io/hashicorp/kubernetes/2.38.0/linux_amd64/terraform-provider-kubernetes_v2.38.0_x5 id=2460
2025-12-27T12:23:59.468Z [INFO]  provider: configuring client automatic mTLS
2025-12-27T12:23:59.476Z [INFO]  provider.terraform-provider-null_v3.2.4_x5: configuring server automatic mTLS: timestamp=2025-12-27T12:23:59.476Z
2025-12-27T12:23:59.503Z [INFO]  provider: plugin process exited: plugin=.terraform/providers/registry.terraform.io/hashicorp/null/3.2.4/linux_amd64/terraform-provider-null_v3.2.4_x5 id=2469
2025-12-27T12:23:59.504Z [INFO]  provider: configuring client automatic mTLS
2025-12-27T12:23:59.512Z [INFO]  provider.terraform-provider-time_v0.13.1_x5: configuring server automatic mTLS: timestamp=2025-12-27T12:23:59.512Z
2025-12-27T12:23:59.540Z [INFO]  provider: plugin process exited: plugin=.terraform/providers/registry.terraform.io/hashicorp/time/0.13.1/linux_amd64/terraform-provider-time_v0.13.1_x5 id=2478
2025-12-27T12:23:59.540Z [INFO]  provider: configuring client automatic mTLS
2025-12-27T12:23:59.550Z [INFO]  provider.terraform-provider-tls_v4.1.0_x5: configuring server automatic mTLS: timestamp=2025-12-27T12:23:59.550Z
2025-12-27T12:23:59.579Z [INFO]  provider: plugin process exited: plugin=.terraform/providers/registry.terraform.io/hashicorp/tls/4.1.0/linux_amd64/terraform-provider-tls_v4.1.0_x5 id=2487
2025-12-27T12:23:59.695Z [INFO]  provider: configuring client automatic mTLS
2025-12-27T12:23:59.882Z [INFO]  provider.terraform-provider-aws_v6.27.0_x5: configuring server automatic mTLS: timestamp=2025-12-27T12:23:59.882Z
2025-12-27T12:23:59.906Z [INFO]  provider: configuring client automatic mTLS
2025-12-27T12:23:59.917Z [INFO]  provider.terraform-provider-tls_v4.1.0_x5: configuring server automatic mTLS: timestamp=2025-12-27T12:23:59.917Z
2025-12-27T12:23:59.942Z [INFO]  provider: configuring client automatic mTLS
2025-12-27T12:23:59.951Z [INFO]  provider.terraform-provider-cloudinit_v2.3.7_x5: configuring server automatic mTLS: timestamp=2025-12-27T12:23:59.951Z
2025-12-27T12:23:59.979Z [INFO]  provider: configuring client automatic mTLS
2025-12-27T12:23:59.992Z [INFO]  provider.terraform-provider-time_v0.13.1_x5: configuring server automatic mTLS: timestamp=2025-12-27T12:23:59.992Z
2025-12-27T12:24:00.017Z [INFO]  provider: configuring client automatic mTLS
2025-12-27T12:24:00.028Z [INFO]  provider.terraform-provider-null_v3.2.4_x5: configuring server automatic mTLS: timestamp=2025-12-27T12:24:00.028Z
2025-12-27T12:24:00.155Z [INFO]  provider: plugin process exited: plugin=.terraform/providers/registry.terraform.io/hashicorp/tls/4.1.0/linux_amd64/terraform-provider-tls_v4.1.0_x5 id=2504
2025-12-27T12:24:00.157Z [INFO]  provider: plugin process exited: plugin=.terraform/providers/registry.terraform.io/hashicorp/time/0.13.1/linux_amd64/terraform-provider-time_v0.13.1_x5 id=2519
2025-12-27T12:24:00.162Z [INFO]  provider: plugin process exited: plugin=.terraform/providers/registry.terraform.io/hashicorp/null/3.2.4/linux_amd64/terraform-provider-null_v3.2.4_x5 id=2527
2025-12-27T12:24:00.169Z [INFO]  provider: plugin process exited: plugin=.terraform/providers/registry.terraform.io/hashicorp/cloudinit/2.3.7/linux_amd64/terraform-provider-cloudinit_v2.3.7_x5 id=2511
2025-12-27T12:24:00.188Z [INFO]  provider: plugin process exited: plugin=.terraform/providers/registry.terraform.io/hashicorp/aws/6.27.0/linux_amd64/terraform-provider-aws_v6.27.0_x5 id=2496
2025-12-27T12:24:00.189Z [INFO]  backend/local: plan calling Plan
2025-12-27T12:24:00.316Z [INFO]  provider: configuring client automatic mTLS
2025-12-27T12:24:00.357Z [INFO]  provider.terraform-provider-null_v3.2.4_x5: configuring server automatic mTLS: timestamp=2025-12-27T12:24:00.354Z
2025-12-27T12:24:00.382Z [INFO]  provider: configuring client automatic mTLS
2025-12-27T12:24:00.392Z [INFO]  provider.terraform-provider-time_v0.13.1_x5: configuring server automatic mTLS: timestamp=2025-12-27T12:24:00.392Z
2025-12-27T12:24:00.416Z [INFO]  provider: configuring client automatic mTLS
2025-12-27T12:24:00.425Z [INFO]  provider.terraform-provider-cloudinit_v2.3.7_x5: configuring server automatic mTLS: timestamp=2025-12-27T12:24:00.425Z
2025-12-27T12:24:00.449Z [INFO]  provider: configuring client automatic mTLS
2025-12-27T12:24:00.623Z [INFO]  provider.terraform-provider-aws_v6.27.0_x5: configuring server automatic mTLS: timestamp=2025-12-27T12:24:00.622Z
2025-12-27T12:24:00.647Z [INFO]  provider: configuring client automatic mTLS
2025-12-27T12:24:00.657Z [INFO]  provider.terraform-provider-tls_v4.1.0_x5: configuring server automatic mTLS: timestamp=2025-12-27T12:24:00.657Z
2025-12-27T12:24:00.741Z [INFO]  provider.terraform-provider-aws_v6.27.0_x5: Retrieved credentials: tf_aws.credentials_source=EnvConfigCredentials tf_mux_provider="*schema.GRPCProviderServer" tf_req_id=8866f28b-6d05-5cbb-10bd-0bdd73a09d4f @module=aws.aws-base tf_provider_addr=registry.terraform.io/hashicorp/aws tf_rpc=ConfigureProvider @caller=github.com/hashicorp/aws-sdk-go-base/v2@v2.0.0-beta.69/logging/tf_logger.go:39 timestamp=2025-12-27T12:24:00.741Z
2025-12-27T12:24:01.126Z [INFO]  provider.terraform-provider-aws_v6.27.0_x5: Retrieved caller identity from STS: tf_mux_provider="*schema.GRPCProviderServer" tf_req_id=8866f28b-6d05-5cbb-10bd-0bdd73a09d4f tf_rpc=ConfigureProvider tf_provider_addr=registry.terraform.io/hashicorp/aws @caller=github.com/hashicorp/aws-sdk-go-base/v2@v2.0.0-beta.69/logging/tf_logger.go:39 @module=aws.aws-base timestamp=2025-12-27T12:24:01.126Z
module.eks.data.aws_iam_policy_document.assume_role_policy[0]: Reading...
module.eks.data.aws_partition.current[0]: Reading...
module.eks.data.aws_caller_identity.current[0]: Reading...
module.eks.module.kms.data.aws_caller_identity.current[0]: Reading...
module.eks.module.kms.data.aws_partition.current[0]: Reading...
data.aws_caller_identity.current: Reading...
module.eks.data.aws_partition.current[0]: Read complete after 0s [id=aws]
module.eks.data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2830595799]
module.eks.module.kms.data.aws_partition.current[0]: Read complete after 0s [id=aws]
2025-12-27T12:24:01.149Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for module.eks.aws_cloudwatch_log_group.this[0], but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .skip_destroy: planned value cty.False for a non-computed attribute
2025-12-27T12:24:01.152Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for module.vpc.aws_default_security_group.this[0], but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .revoke_rules_on_delete: planned value cty.False for a non-computed attribute
2025-12-27T12:24:01.163Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for module.vpc.aws_subnet.private[1], but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .map_public_ip_on_launch: planned value cty.False for a non-computed attribute
2025-12-27T12:24:01.164Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for module.vpc.aws_default_route_table.default[0], but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .propagating_vgws: planned value cty.NullVal(cty.Set(cty.String)) does not match config value cty.SetValEmpty(cty.String)
2025-12-27T12:24:01.165Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for module.eks.aws_security_group.cluster[0], but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .revoke_rules_on_delete: planned value cty.False for a non-computed attribute
2025-12-27T12:24:01.169Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for module.vpc.aws_subnet.private[0], but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .map_public_ip_on_launch: planned value cty.False for a non-computed attribute
2025-12-27T12:24:01.170Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for module.eks.aws_security_group.node[0], but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .revoke_rules_on_delete: planned value cty.False for a non-computed attribute
2025-12-27T12:24:01.191Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for module.eks.aws_security_group_rule.node["ingress_cluster_kubelet"], but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .self: planned value cty.False for a non-computed attribute
2025-12-27T12:24:01.191Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for module.eks.aws_security_group_rule.node["ingress_cluster_443"], but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .self: planned value cty.False for a non-computed attribute
2025-12-27T12:24:01.193Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for module.eks.aws_security_group_rule.node["ingress_cluster_4443_webhook"], but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .self: planned value cty.False for a non-computed attribute
2025-12-27T12:24:01.194Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for module.eks.aws_security_group_rule.node["ingress_cluster_8443_webhook"], but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .self: planned value cty.False for a non-computed attribute
2025-12-27T12:24:01.194Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for module.eks.aws_security_group_rule.node["ingress_cluster_9443_webhook"], but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .self: planned value cty.False for a non-computed attribute
2025-12-27T12:24:01.194Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for module.eks.aws_security_group_rule.node["egress_all"], but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .self: planned value cty.False for a non-computed attribute
2025-12-27T12:24:01.197Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for module.eks.aws_security_group_rule.node["ingress_cluster_6443_webhook"], but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .self: planned value cty.False for a non-computed attribute
2025-12-27T12:24:01.200Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for module.eks.aws_security_group_rule.node["ingress_cluster_10251_webhook"], but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .self: planned value cty.False for a non-computed attribute
2025-12-27T12:24:01.203Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for module.eks.aws_security_group_rule.cluster["ingress_nodes_443"], but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .self: planned value cty.False for a non-computed attribute
2025-12-27T12:24:01.204Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for module.vpc.aws_nat_gateway.this[0], but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .connectivity_type: planned value cty.StringVal("public") for a non-computed attribute
data.aws_caller_identity.current: Read complete after 0s [id=910681227783]
2025-12-27T12:24:01.242Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_iam_role.node, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .force_detach_policies: planned value cty.False for a non-computed attribute
      - .max_session_duration: planned value cty.NumberIntVal(3600) for a non-computed attribute
      - .path: planned value cty.StringVal("/") for a non-computed attribute
      - .inline_policy: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead
2025-12-27T12:24:01.242Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for module.eks.aws_iam_role.this[0], but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .max_session_duration: planned value cty.NumberIntVal(3600) for a non-computed attribute
      - .assume_role_policy: planned value cty.StringVal("{\"Statement\":[{\"Action\":[\"sts:TagSession\",\"sts:AssumeRole\"],\"Effect\":\"Allow\",\"Principal\":{\"Service\":\"eks.amazonaws.com\"},\"Sid\":\"EKSClusterAssumeRole\"}],\"Version\":\"2012-10-17\"}") does not match config value cty.StringVal("{\n  \"Version\": \"2012-10-17\",\n  \"Statement\": [\n    {\n      \"Sid\": \"EKSClusterAssumeRole\",\n      \"Effect\": \"Allow\",\n      \"Action\": [\n        \"sts:TagSession\",\n        \"sts:AssumeRole\"\n      ],\n      \"Principal\": {\n        \"Service\": \"eks.amazonaws.com\"\n      }\n    }\n  ]\n}")
      - .path: planned value cty.StringVal("/") for a non-computed attribute
      - .inline_policy: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead
2025-12-27T12:24:01.242Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_iam_role.cluster, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .force_detach_policies: planned value cty.False for a non-computed attribute
      - .max_session_duration: planned value cty.NumberIntVal(3600) for a non-computed attribute
      - .path: planned value cty.StringVal("/") for a non-computed attribute
      - .inline_policy: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead
2025-12-27T12:24:01.242Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_iam_role.ebs_csi_driver, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .path: planned value cty.StringVal("/") for a non-computed attribute
      - .force_detach_policies: planned value cty.False for a non-computed attribute
      - .max_session_duration: planned value cty.NumberIntVal(3600) for a non-computed attribute
      - .inline_policy: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead
module.eks.data.aws_iam_policy_document.node_assume_role_policy[0]: Reading...
module.eks.data.aws_iam_policy_document.node_assume_role_policy[0]: Read complete after 0s [id=3518401652]
module.eks.data.aws_iam_policy_document.custom[0]: Reading...
2025-12-27T12:24:01.265Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for module.eks.aws_iam_role.eks_auto[0], but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .max_session_duration: planned value cty.NumberIntVal(3600) for a non-computed attribute
      - .assume_role_policy: planned value cty.StringVal("{\"Statement\":[{\"Action\":[\"sts:TagSession\",\"sts:AssumeRole\"],\"Effect\":\"Allow\",\"Principal\":{\"Service\":\"ec2.amazonaws.com\"},\"Sid\":\"EKSAutoNodeAssumeRole\"}],\"Version\":\"2012-10-17\"}") does not match config value cty.StringVal("{\n  \"Version\": \"2012-10-17\",\n  \"Statement\": [\n    {\n      \"Sid\": \"EKSAutoNodeAssumeRole\",\n      \"Effect\": \"Allow\",\n      \"Action\": [\n        \"sts:TagSession\",\n        \"sts:AssumeRole\"\n      ],\n      \"Principal\": {\n        \"Service\": \"ec2.amazonaws.com\"\n      }\n    }\n  ]\n}")
      - .path: planned value cty.StringVal("/") for a non-computed attribute
      - .inline_policy: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead
module.eks.data.aws_iam_policy_document.custom[0]: Read complete after 0s [id=513122117]
2025-12-27T12:24:01.280Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for module.eks.aws_iam_policy.custom[0], but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .policy: planned value cty.StringVal("{\"Statement\":[{\"Action\":[\"ec2:RunInstances\",\"ec2:CreateLaunchTemplate\",\"ec2:CreateFleet\"],\"Condition\":{\"StringEquals\":{\"aws:RequestTag/eks:eks-cluster-name\":\"${aws:PrincipalTag/eks:eks-cluster-name}\"},\"StringLike\":{\"aws:RequestTag/eks:kubernetes-node-class-name\":\"*\",\"aws:RequestTag/eks:kubernetes-node-pool-name\":\"*\"}},\"Effect\":\"Allow\",\"Resource\":\"*\",\"Sid\":\"Compute\"},{\"Action\":[\"ec2:CreateVolume\",\"ec2:CreateSnapshot\"],\"Condition\":{\"StringEquals\":{\"aws:RequestTag/eks:eks-cluster-name\":\"${aws:PrincipalTag/eks:eks-cluster-name}\"}},\"Effect\":\"Allow\",\"Resource\":[\"arn:aws:ec2:*:*:volume/*\",\"arn:aws:ec2:*:*:snapshot/*\"],\"Sid\":\"Storage\"},{\"Action\":\"ec2:CreateNetworkInterface\",\"Condition\":{\"StringEquals\":{\"aws:RequestTag/eks:eks-cluster-name\":\"${aws:PrincipalTag/eks:eks-cluster-name}\",\"aws:RequestTag/eks:kubernetes-cni-node-name\":\"*\"}},\"Effect\":\"Allow\",\"Resource\":\"*\",\"Sid\":\"Networking\"},{\"Action\":[\"elasticloadbalancing:CreateTargetGroup\",\"elasticloadbalancing:CreateRule\",\"elasticloadbalancing:CreateLoadBalancer\",\"elasticloadbalancing:CreateListener\",\"ec2:CreateSecurityGroup\"],\"Condition\":{\"StringEquals\":{\"aws:RequestTag/eks:eks-cluster-name\":\"${aws:PrincipalTag/eks:eks-cluster-name}\"}},\"Effect\":\"Allow\",\"Resource\":\"*\",\"Sid\":\"LoadBalancer\"},{\"Action\":\"shield:CreateProtection\",\"Condition\":{\"StringEquals\":{\"aws:RequestTag/eks:eks-cluster-name\":\"${aws:PrincipalTag/eks:eks-cluster-name}\"}},\"Effect\":\"Allow\",\"Resource\":\"*\",\"Sid\":\"ShieldProtection\"},{\"Action\":\"shield:TagResource\",\"Condition\":{\"StringEquals\":{\"aws:RequestTag/eks:eks-cluster-name\":\"${aws:PrincipalTag/eks:eks-cluster-name}\"}},\"Effect\":\"Allow\",\"Resource\":\"arn:aws:shield::*:protection/*\",\"Sid\":\"ShieldTagResource\"}],\"Version\":\"2012-10-17\"}") does not match config value cty.StringVal("{\n  \"Version\": \"2012-10-17\",\n  \"Statement\": [\n    {\n      \"Sid\": \"Compute\",\n      \"Effect\": \"Allow\",\n      \"Action\": [\n        \"ec2:RunInstances\",\n        \"ec2:CreateLaunchTemplate\",\n        \"ec2:CreateFleet\"\n      ],\n      \"Resource\": \"*\",\n      \"Condition\": {\n        \"StringEquals\": {\n          \"aws:RequestTag/eks:eks-cluster-name\": \"${aws:PrincipalTag/eks:eks-cluster-name}\"\n        },\n        \"StringLike\": {\n          \"aws:RequestTag/eks:kubernetes-node-class-name\": \"*\",\n          \"aws:RequestTag/eks:kubernetes-node-pool-name\": \"*\"\n        }\n      }\n    },\n    {\n      \"Sid\": \"Storage\",\n      \"Effect\": \"Allow\",\n      \"Action\": [\n        \"ec2:CreateVolume\",\n        \"ec2:CreateSnapshot\"\n      ],\n      \"Resource\": [\n        \"arn:aws:ec2:*:*:volume/*\",\n        \"arn:aws:ec2:*:*:snapshot/*\"\n      ],\n      \"Condition\": {\n        \"StringEquals\": {\n          \"aws:RequestTag/eks:eks-cluster-name\": \"${aws:PrincipalTag/eks:eks-cluster-name}\"\n        }\n      }\n    },\n    {\n      \"Sid\": \"Networking\",\n      \"Effect\": \"Allow\",\n      \"Action\": \"ec2:CreateNetworkInterface\",\n      \"Resource\": \"*\",\n      \"Condition\": {\n        \"StringEquals\": {\n          \"aws:RequestTag/eks:eks-cluster-name\": \"${aws:PrincipalTag/eks:eks-cluster-name}\",\n          \"aws:RequestTag/eks:kubernetes-cni-node-name\": \"*\"\n        }\n      }\n    },\n    {\n      \"Sid\": \"LoadBalancer\",\n      \"Effect\": \"Allow\",\n      \"Action\": [\n        \"elasticloadbalancing:CreateTargetGroup\",\n        \"elasticloadbalancing:CreateRule\",\n        \"elasticloadbalancing:CreateLoadBalancer\",\n        \"elasticloadbalancing:CreateListener\",\n        \"ec2:CreateSecurityGroup\"\n      ],\n      \"Resource\": \"*\",\n      \"Condition\": {\n        \"StringEquals\": {\n          \"aws:RequestTag/eks:eks-cluster-name\": \"${aws:PrincipalTag/eks:eks-cluster-name}\"\n        }\n      }\n    },\n    {\n      \"Sid\": \"ShieldProtection\",\n      \"Effect\": \"Allow\",\n      \"Action\": \"shield:CreateProtection\",\n      \"Resource\": \"*\",\n      \"Condition\": {\n        \"StringEquals\": {\n          \"aws:RequestTag/eks:eks-cluster-name\": \"${aws:PrincipalTag/eks:eks-cluster-name}\"\n        }\n      }\n    },\n    {\n      \"Sid\": \"ShieldTagResource\",\n      \"Effect\": \"Allow\",\n      \"Action\": \"shield:TagResource\",\n      \"Resource\": \"arn:aws:shield::*:protection/*\",\n      \"Condition\": {\n        \"StringEquals\": {\n          \"aws:RequestTag/eks:eks-cluster-name\": \"${aws:PrincipalTag/eks:eks-cluster-name}\"\n        }\n      }\n    }\n  ]\n}")
      - .path: planned value cty.StringVal("/") for a non-computed attribute
module.eks.data.aws_caller_identity.current[0]: Read complete after 0s [id=910681227783]
module.eks.data.aws_iam_session_context.current[0]: Reading...
module.eks.data.aws_iam_session_context.current[0]: Read complete after 0s [id=arn:aws:iam::910681227783:user/mbocak]
module.eks.module.kms.data.aws_caller_identity.current[0]: Read complete after 0s [id=910681227783]
2025-12-27T12:24:01.429Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for module.eks.module.kms.aws_kms_key.this[0], but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .bypass_policy_lockout_safety_check: planned value cty.False for a non-computed attribute
      - .is_enabled: planned value cty.True for a non-computed attribute
      - .customer_master_key_spec: planned value cty.StringVal("SYMMETRIC_DEFAULT") for a non-computed attribute
2025-12-27T12:24:01.434Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for module.eks.aws_iam_policy.cluster_encryption[0], but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .path: planned value cty.StringVal("/") for a non-computed attribute
2025-12-27T12:24:01.439Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for module.eks.aws_eks_cluster.this[0], but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .upgrade_policy: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead
      - .vpc_config[0].subnet_ids: planned value cty.UnknownVal(cty.Set(cty.String)) does not match config value cty.SetVal([]cty.Value{cty.UnknownVal(cty.String), cty.UnknownVal(cty.String)})
      - .control_plane_scaling_config: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead
2025-12-27T12:24:01.443Z [INFO]  provider: plugin process exited: plugin=.terraform/providers/registry.terraform.io/hashicorp/tls/4.1.0/linux_amd64/terraform-provider-tls_v4.1.0_x5 id=2567
2025-12-27T12:24:01.455Z [INFO]  provider: plugin process exited: plugin=.terraform/providers/registry.terraform.io/hashicorp/time/0.13.1/linux_amd64/terraform-provider-time_v0.13.1_x5 id=2544
2025-12-27T12:24:01.456Z [INFO]  provider: plugin process exited: plugin=.terraform/providers/registry.terraform.io/hashicorp/null/3.2.4/linux_amd64/terraform-provider-null_v3.2.4_x5 id=2536
2025-12-27T12:24:01.458Z [INFO]  provider: plugin process exited: plugin=.terraform/providers/registry.terraform.io/hashicorp/cloudinit/2.3.7/linux_amd64/terraform-provider-cloudinit_v2.3.7_x5 id=2551
2025-12-27T12:24:01.479Z [INFO]  provider: plugin process exited: plugin=.terraform/providers/registry.terraform.io/hashicorp/aws/6.27.0/linux_amd64/terraform-provider-aws_v6.27.0_x5 id=2559
2025-12-27T12:24:01.633Z [INFO]  backend/local: plan operation completed
2025-12-27T12:24:01.633Z [INFO]  backend/local: writing plan output to: tfplan

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # aws_eks_pod_identity_association.ebs_csi_driver will be created
  + resource "aws_eks_pod_identity_association" "ebs_csi_driver" {
      + association_arn      = (known after apply)
      + association_id       = (known after apply)
      + cluster_name         = "mbocak-microservices-qa-env"
      + disable_session_tags = false
      + external_id          = (known after apply)
      + id                   = (known after apply)
      + namespace            = "kube-system"
      + region               = "eu-west-1"
      + role_arn             = (known after apply)
      + service_account      = "ebs-csi-controller-sa"
      + tags                 = {
          + "env"     = "qa-tests"
          + "owner"   = "mbocak"
          + "project" = "k8s-microservices-qa-env"
        }
      + tags_all             = {
          + "env"     = "qa-tests"
          + "owner"   = "mbocak"
          + "project" = "k8s-microservices-qa-env"
        }
    }

  # aws_iam_role.cluster will be created
  + resource "aws_iam_role" "cluster" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "eks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "mbocak-microservices-qa-env-cluster-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + permissions_boundary  = "arn:aws:iam::910681227783:policy/DefaultBoundaryPolicy"
      + tags                  = {
          + "env"     = "qa-tests"
          + "owner"   = "mbocak"
          + "project" = "k8s-microservices-qa-env"
        }
      + tags_all              = {
          + "env"     = "qa-tests"
          + "owner"   = "mbocak"
          + "project" = "k8s-microservices-qa-env"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # aws_iam_role.ebs_csi_driver will be created
  + resource "aws_iam_role" "ebs_csi_driver" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = [
                          + "sts:AssumeRole",
                          + "sts:TagSession",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "pods.eks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "mbocak-microservices-qa-env-ebs-csi-driver-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + permissions_boundary  = "arn:aws:iam::910681227783:policy/DefaultBoundaryPolicy"
      + tags                  = {
          + "Name"    = "mbocak-microservices-qa-env-ebs-csi-driver-role"
          + "env"     = "qa-tests"
          + "owner"   = "mbocak"
          + "project" = "k8s-microservices-qa-env"
        }
      + tags_all              = {
          + "Name"    = "mbocak-microservices-qa-env-ebs-csi-driver-role"
          + "env"     = "qa-tests"
          + "owner"   = "mbocak"
          + "project" = "k8s-microservices-qa-env"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # aws_iam_role.node will be created
  + resource "aws_iam_role" "node" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "mbocak-microservices-qa-env-node-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + permissions_boundary  = "arn:aws:iam::910681227783:policy/DefaultBoundaryPolicy"
      + tags                  = {
          + "env"     = "qa-tests"
          + "owner"   = "mbocak"
          + "project" = "k8s-microservices-qa-env"
        }
      + tags_all              = {
          + "env"     = "qa-tests"
          + "owner"   = "mbocak"
          + "project" = "k8s-microservices-qa-env"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # aws_iam_role_policy_attachment.cluster_policies["arn:aws:iam::aws:policy/AmazonEKSBlockStoragePolicy"] will be created
  + resource "aws_iam_role_policy_attachment" "cluster_policies" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSBlockStoragePolicy"
      + role       = "mbocak-microservices-qa-env-cluster-role"
    }

  # aws_iam_role_policy_attachment.cluster_policies["arn:aws:iam::aws:policy/AmazonEKSClusterPolicy"] will be created
  + resource "aws_iam_role_policy_attachment" "cluster_policies" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSClusterPolicy"
      + role       = "mbocak-microservices-qa-env-cluster-role"
    }

  # aws_iam_role_policy_attachment.cluster_policies["arn:aws:iam::aws:policy/AmazonEKSComputePolicy"] will be created
  + resource "aws_iam_role_policy_attachment" "cluster_policies" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSComputePolicy"
      + role       = "mbocak-microservices-qa-env-cluster-role"
    }

  # aws_iam_role_policy_attachment.cluster_policies["arn:aws:iam::aws:policy/AmazonEKSLoadBalancingPolicy"] will be created
  + resource "aws_iam_role_policy_attachment" "cluster_policies" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSLoadBalancingPolicy"
      + role       = "mbocak-microservices-qa-env-cluster-role"
    }

  # aws_iam_role_policy_attachment.cluster_policies["arn:aws:iam::aws:policy/AmazonEKSNetworkingPolicy"] will be created
  + resource "aws_iam_role_policy_attachment" "cluster_policies" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSNetworkingPolicy"
      + role       = "mbocak-microservices-qa-env-cluster-role"
    }

  # aws_iam_role_policy_attachment.ebs_csi_driver_policy will be created
  + resource "aws_iam_role_policy_attachment" "ebs_csi_driver_policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonEBSCSIDriverPolicy"
      + role       = "mbocak-microservices-qa-env-ebs-csi-driver-role"
    }

  # aws_iam_role_policy_attachment.node_policies["arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"] will be created
  + resource "aws_iam_role_policy_attachment" "node_policies" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"
      + role       = "mbocak-microservices-qa-env-node-role"
    }

  # aws_iam_role_policy_attachment.node_policies["arn:aws:iam::aws:policy/AmazonEKSWorkerNodeMinimalPolicy"] will be created
  + resource "aws_iam_role_policy_attachment" "node_policies" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSWorkerNodeMinimalPolicy"
      + role       = "mbocak-microservices-qa-env-node-role"
    }

  # module.eks.data.aws_eks_addon_version.this["aws-ebs-csi-driver"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_eks_addon_version" "this" {
      + addon_name         = "aws-ebs-csi-driver"
      + id                 = (known after apply)
      + kubernetes_version = "1.34"
      + most_recent        = true
      + region             = (known after apply)
      + version            = (known after apply)
    }

  # module.eks.data.aws_eks_addon_version.this["coredns"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_eks_addon_version" "this" {
      + addon_name         = "coredns"
      + id                 = (known after apply)
      + kubernetes_version = "1.34"
      + most_recent        = true
      + region             = (known after apply)
      + version            = (known after apply)
    }

  # module.eks.data.aws_eks_addon_version.this["kube-proxy"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_eks_addon_version" "this" {
      + addon_name         = "kube-proxy"
      + id                 = (known after apply)
      + kubernetes_version = "1.34"
      + most_recent        = true
      + region             = (known after apply)
      + version            = (known after apply)
    }

  # module.eks.data.aws_eks_addon_version.this["vpc-cni"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_eks_addon_version" "this" {
      + addon_name         = "vpc-cni"
      + id                 = (known after apply)
      + kubernetes_version = "1.34"
      + most_recent        = true
      + region             = (known after apply)
      + version            = (known after apply)
    }

  # module.eks.aws_cloudwatch_log_group.this[0] will be created
  + resource "aws_cloudwatch_log_group" "this" {
      + arn                         = (known after apply)
      + deletion_protection_enabled = (known after apply)
      + id                          = (known after apply)
      + log_group_class             = (known after apply)
      + name                        = "/aws/eks/mbocak-microservices-qa-env/cluster"
      + name_prefix                 = (known after apply)
      + region                      = "eu-west-1"
      + retention_in_days           = 90
      + skip_destroy                = false
      + tags                        = {
          + "Name"    = "/aws/eks/mbocak-microservices-qa-env/cluster"
          + "env"     = "qa-tests"
          + "owner"   = "mbocak"
          + "project" = "k8s-microservices-qa-env"
        }
      + tags_all                    = {
          + "Name"    = "/aws/eks/mbocak-microservices-qa-env/cluster"
          + "env"     = "qa-tests"
          + "owner"   = "mbocak"
          + "project" = "k8s-microservices-qa-env"
        }
    }

  # module.eks.aws_ec2_tag.cluster_primary_security_group["env"] will be created
  + resource "aws_ec2_tag" "cluster_primary_security_group" {
      + id          = (known after apply)
      + key         = "env"
      + region      = "eu-west-1"
      + resource_id = (known after apply)
      + value       = "qa-tests"
    }

  # module.eks.aws_ec2_tag.cluster_primary_security_group["owner"] will be created
  + resource "aws_ec2_tag" "cluster_primary_security_group" {
      + id          = (known after apply)
      + key         = "owner"
      + region      = "eu-west-1"
      + resource_id = (known after apply)
      + value       = "mbocak"
    }

  # module.eks.aws_ec2_tag.cluster_primary_security_group["project"] will be created
  + resource "aws_ec2_tag" "cluster_primary_security_group" {
      + id          = (known after apply)
      + key         = "project"
      + region      = "eu-west-1"
      + resource_id = (known after apply)
      + value       = "k8s-microservices-qa-env"
    }

  # module.eks.aws_eks_access_entry.this["cluster_creator"] will be created
  + resource "aws_eks_access_entry" "this" {
      + access_entry_arn  = (known after apply)
      + cluster_name      = (known after apply)
      + created_at        = (known after apply)
      + id                = (known after apply)
      + kubernetes_groups = (known after apply)
      + modified_at       = (known after apply)
      + principal_arn     = "arn:aws:iam::910681227783:user/mbocak"
      + region            = "eu-west-1"
      + tags              = {
          + "env"     = "qa-tests"
          + "owner"   = "mbocak"
          + "project" = "k8s-microservices-qa-env"
        }
      + tags_all          = {
          + "env"     = "qa-tests"
          + "owner"   = "mbocak"
          + "project" = "k8s-microservices-qa-env"
        }
      + type              = "STANDARD"
      + user_name         = (known after apply)
    }

  # module.eks.aws_eks_access_policy_association.this["cluster_creator_admin"] will be created
  + resource "aws_eks_access_policy_association" "this" {
      + associated_at = (known after apply)
      + cluster_name  = (known after apply)
      + id            = (known after apply)
      + modified_at   = (known after apply)
      + policy_arn    = "arn:aws:eks::aws:cluster-access-policy/AmazonEKSClusterAdminPolicy"
      + principal_arn = "arn:aws:iam::910681227783:user/mbocak"
      + region        = "eu-west-1"

      + access_scope {
          + type = "cluster"
        }
    }

  # module.eks.aws_eks_addon.this["aws-ebs-csi-driver"] will be created
  + resource "aws_eks_addon" "this" {
      + addon_name                  = "aws-ebs-csi-driver"
      + addon_version               = (known after apply)
      + arn                         = (known after apply)
      + cluster_name                = (known after apply)
      + configuration_values        = (known after apply)
      + created_at                  = (known after apply)
      + id                          = (known after apply)
      + modified_at                 = (known after apply)
      + preserve                    = true
      + region                      = "eu-west-1"
      + resolve_conflicts_on_create = "NONE"
      + resolve_conflicts_on_update = "OVERWRITE"
      + tags                        = {
          + "env"     = "qa-tests"
          + "owner"   = "mbocak"
          + "project" = "k8s-microservices-qa-env"
        }
      + tags_all                    = {
          + "env"     = "qa-tests"
          + "owner"   = "mbocak"
          + "project" = "k8s-microservices-qa-env"
        }

      + timeouts {}
    }

  # module.eks.aws_eks_addon.this["coredns"] will be created
  + resource "aws_eks_addon" "this" {
      + addon_name                  = "coredns"
      + addon_version               = (known after apply)
      + arn                         = (known after apply)
      + cluster_name                = (known after apply)
      + configuration_values        = (known after apply)
      + created_at                  = (known after apply)
      + id                          = (known after apply)
      + modified_at                 = (known after apply)
      + preserve                    = true
      + region                      = "eu-west-1"
      + resolve_conflicts_on_create = "NONE"
      + resolve_conflicts_on_update = "OVERWRITE"
      + tags                        = {
          + "env"     = "qa-tests"
          + "owner"   = "mbocak"
          + "project" = "k8s-microservices-qa-env"
        }
      + tags_all                    = {
          + "env"     = "qa-tests"
          + "owner"   = "mbocak"
          + "project" = "k8s-microservices-qa-env"
        }

      + timeouts {}
    }

  # module.eks.aws_eks_addon.this["kube-proxy"] will be created
  + resource "aws_eks_addon" "this" {
      + addon_name                  = "kube-proxy"
      + addon_version               = (known after apply)
      + arn                         = (known after apply)
      + cluster_name                = (known after apply)
      + configuration_values        = (known after apply)
      + created_at                  = (known after apply)
      + id                          = (known after apply)
      + modified_at                 = (known after apply)
      + preserve                    = true
      + region                      = "eu-west-1"
      + resolve_conflicts_on_create = "NONE"
      + resolve_conflicts_on_update = "OVERWRITE"
      + tags                        = {
          + "env"     = "qa-tests"
          + "owner"   = "mbocak"
          + "project" = "k8s-microservices-qa-env"
        }
      + tags_all                    = {
          + "env"     = "qa-tests"
          + "owner"   = "mbocak"
          + "project" = "k8s-microservices-qa-env"
        }

      + timeouts {}
    }

  # module.eks.aws_eks_addon.this["vpc-cni"] will be created
  + resource "aws_eks_addon" "this" {
      + addon_name                  = "vpc-cni"
      + addon_version               = (known after apply)
      + arn                         = (known after apply)
      + cluster_name                = (known after apply)
      + configuration_values        = (known after apply)
      + created_at                  = (known after apply)
      + id                          = (known after apply)
      + modified_at                 = (known after apply)
      + preserve                    = true
      + region                      = "eu-west-1"
      + resolve_conflicts_on_create = "NONE"
      + resolve_conflicts_on_update = "OVERWRITE"
      + tags                        = {
          + "env"     = "qa-tests"
          + "owner"   = "mbocak"
          + "project" = "k8s-microservices-qa-env"
        }
      + tags_all                    = {
          + "env"     = "qa-tests"
          + "owner"   = "mbocak"
          + "project" = "k8s-microservices-qa-env"
        }

      + timeouts {}
    }

  # module.eks.aws_eks_cluster.this[0] will be created
  + resource "aws_eks_cluster" "this" {
      + arn                           = (known after apply)
      + bootstrap_self_managed_addons = false
      + certificate_authority         = (known after apply)
      + cluster_id                    = (known after apply)
      + created_at                    = (known after apply)
      + deletion_protection           = (known after apply)
      + enabled_cluster_log_types     = [
          + "api",
          + "audit",
          + "authenticator",
        ]
      + endpoint                      = (known after apply)
      + id                            = (known after apply)
      + identity                      = (known after apply)
      + name                          = "mbocak-microservices-qa-env"
      + platform_version              = (known after apply)
      + region                        = "eu-west-1"
      + role_arn                      = (known after apply)
      + status                        = (known after apply)
      + tags                          = {
          + "env"                   = "qa-tests"
          + "owner"                 = "mbocak"
          + "project"               = "k8s-microservices-qa-env"
          + "terraform-aws-modules" = "eks"
        }
      + tags_all                      = {
          + "env"                   = "qa-tests"
          + "owner"                 = "mbocak"
          + "project"               = "k8s-microservices-qa-env"
          + "terraform-aws-modules" = "eks"
        }
      + version                       = "1.34"

      + access_config {
          + authentication_mode                         = "API_AND_CONFIG_MAP"
          + bootstrap_cluster_creator_admin_permissions = false
        }

      + compute_config {
          + enabled       = true
          + node_pools    = [
              + "general-purpose",
            ]
          + node_role_arn = (known after apply)
        }

      + control_plane_scaling_config (known after apply)

      + encryption_config {
          + resources = [
              + "secrets",
            ]

          + provider {
              + key_arn = (known after apply)
            }
        }

      + kubernetes_network_config {
          + ip_family         = "ipv4"
          + service_ipv4_cidr = (known after apply)
          + service_ipv6_cidr = (known after apply)

          + elastic_load_balancing {
              + enabled = true
            }
        }

      + storage_config {
          + block_storage {
              + enabled = true
            }
        }

      + upgrade_policy (known after apply)

      + vpc_config {
          + cluster_security_group_id = (known after apply)
          + endpoint_private_access   = true
          + endpoint_public_access    = true
          + public_access_cidrs       = [
              + "0.0.0.0/0",
            ]
          + security_group_ids        = (known after apply)
          + subnet_ids                = (known after apply)
          + vpc_id                    = (known after apply)
        }
    }

  # module.eks.aws_iam_policy.cluster_encryption[0] will be created
  + resource "aws_iam_policy" "cluster_encryption" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Cluster encryption policy to allow cluster role to utilize CMK provided"
      + id               = (known after apply)
      + name             = (known after apply)
      + name_prefix      = "mbocak-microservices-qa-env-cluster-ClusterEncryption"
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags             = {
          + "env"     = "qa-tests"
          + "owner"   = "mbocak"
          + "project" = "k8s-microservices-qa-env"
        }
      + tags_all         = {
          + "env"     = "qa-tests"
          + "owner"   = "mbocak"
          + "project" = "k8s-microservices-qa-env"
        }
    }

  # module.eks.aws_iam_policy.custom[0] will be created
  + resource "aws_iam_policy" "custom" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = (known after apply)
      + name_prefix      = "mbocak-microservices-qa-env-cluster-"
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = [
                          + "ec2:RunInstances",
                          + "ec2:CreateLaunchTemplate",
                          + "ec2:CreateFleet",
                        ]
                      + Condition = {
                          + StringEquals = {
                              + "aws:RequestTag/eks:eks-cluster-name" = "${aws:PrincipalTag/eks:eks-cluster-name}"
                            }
                          + StringLike   = {
                              + "aws:RequestTag/eks:kubernetes-node-class-name" = "*"
                              + "aws:RequestTag/eks:kubernetes-node-pool-name"  = "*"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                      + Sid       = "Compute"
                    },
                  + {
                      + Action    = [
                          + "ec2:CreateVolume",
                          + "ec2:CreateSnapshot",
                        ]
                      + Condition = {
                          + StringEquals = {
                              + "aws:RequestTag/eks:eks-cluster-name" = "${aws:PrincipalTag/eks:eks-cluster-name}"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = [
                          + "arn:aws:ec2:*:*:volume/*",
                          + "arn:aws:ec2:*:*:snapshot/*",
                        ]
                      + Sid       = "Storage"
                    },
                  + {
                      + Action    = "ec2:CreateNetworkInterface"
                      + Condition = {
                          + StringEquals = {
                              + "aws:RequestTag/eks:eks-cluster-name"         = "${aws:PrincipalTag/eks:eks-cluster-name}"
                              + "aws:RequestTag/eks:kubernetes-cni-node-name" = "*"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                      + Sid       = "Networking"
                    },
                  + {
                      + Action    = [
                          + "elasticloadbalancing:CreateTargetGroup",
                          + "elasticloadbalancing:CreateRule",
                          + "elasticloadbalancing:CreateLoadBalancer",
                          + "elasticloadbalancing:CreateListener",
                          + "ec2:CreateSecurityGroup",
                        ]
                      + Condition = {
                          + StringEquals = {
                              + "aws:RequestTag/eks:eks-cluster-name" = "${aws:PrincipalTag/eks:eks-cluster-name}"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                      + Sid       = "LoadBalancer"
                    },
                  + {
                      + Action    = "shield:CreateProtection"
                      + Condition = {
                          + StringEquals = {
                              + "aws:RequestTag/eks:eks-cluster-name" = "${aws:PrincipalTag/eks:eks-cluster-name}"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                      + Sid       = "ShieldProtection"
                    },
                  + {
                      + Action    = "shield:TagResource"
                      + Condition = {
                          + StringEquals = {
                              + "aws:RequestTag/eks:eks-cluster-name" = "${aws:PrincipalTag/eks:eks-cluster-name}"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "arn:aws:shield::*:protection/*"
                      + Sid       = "ShieldTagResource"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags             = {
          + "env"     = "qa-tests"
          + "owner"   = "mbocak"
          + "project" = "k8s-microservices-qa-env"
        }
      + tags_all         = {
          + "env"     = "qa-tests"
          + "owner"   = "mbocak"
          + "project" = "k8s-microservices-qa-env"
        }
    }

  # module.eks.aws_iam_role.eks_auto[0] will be created
  + resource "aws_iam_role" "eks_auto" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = [
                          + "sts:TagSession",
                          + "sts:AssumeRole",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                      + Sid       = "EKSAutoNodeAssumeRole"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = "mbocak-microservices-qa-env-eks-auto-"
      + path                  = "/"
      + permissions_boundary  = "arn:aws:iam::910681227783:policy/DefaultBoundaryPolicy"
      + tags                  = {
          + "env"     = "qa-tests"
          + "owner"   = "mbocak"
          + "project" = "k8s-microservices-qa-env"
        }
      + tags_all              = {
          + "env"     = "qa-tests"
          + "owner"   = "mbocak"
          + "project" = "k8s-microservices-qa-env"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.eks.aws_iam_role.this[0] will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = [
                          + "sts:TagSession",
                          + "sts:AssumeRole",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "eks.amazonaws.com"
                        }
                      + Sid       = "EKSClusterAssumeRole"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known afte
```

</details>

---
*Updated at: 2025-12-27T12:23:21Z*
<!-- Sticky Pull Request Commentterraform-plan-qa-tests -->